
export const ITEM_CHARACTERS = [
  'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
  'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z'
];

export const THEMES: { [key: string]: string[] } = {
  Fruits: ['🍓', '🍋', '🍎', '🍇', '🍉', '🍌', '🍒', '🍑', '🍍', '🥝'],
  Vehicles: ['🚗', '🚲', '✈️', '🚀', '⛵️', '🚂', '🚁', '🛸', '🛰️', '🚤'],
  Symbols: ['❤️', '⭐', '☀️', '🌙', '⚡', '🔥', '💧', '❄️', '🌈', '🌍'],
  Animals: ['🐶', '🐱', '🐭', '🐰', '🦊', '🐻', '🐼', '🐨', '🐯', '🦁'],
  Food: ['🍔', '🍕', '🌭', '🌮', '🍩', '🍪', '🍰', '🍦', '🍿', '🍟'],
};

export const THEME_NAMES = Object.keys(THEMES);
